{"keras_version": "2.0.5", "config": [{"config": {"padding": "valid", "name": "block1_conv1", "kernel_size": [2, 2], "batch_input_shape": [null, 30, 30, 3], "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 32, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "dtype": "float32", "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "block1_conv2", "padding": "valid", "activation": "relu", "kernel_size": [2, 2], "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 32, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "name": "block1_pool", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "block2_conv1", "padding": "valid", "activation": "relu", "kernel_size": [2, 2], "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 64, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "block2_conv2", "padding": "valid", "activation": "relu", "kernel_size": [2, 2], "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 128, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "name": "block2_pool", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "block3_conv1", "padding": "valid", "activation": "relu", "kernel_size": [2, 2], "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 256, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "block3_conv2", "padding": "valid", "activation": "relu", "kernel_size": [2, 2], "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 512, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "name": "block3_pool", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "fc1", "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 512, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "fc2", "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 256, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "predictions", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 88, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "cntk", "class_name": "Sequential"}